app/views/chats/index.html.erb

        <ul id="messages">
          <% chat.messages.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = ?  [["chat_id", 3]]