app/channels/chat_channel.rb

INSERT INTO "messages" ("content", "user_type", "chat_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "what is physics?"], ["user_type", "User"], ["chat_id", 1], ["user_id", 1], ["created_at", "2023-08-03 17:09:08.857282"], ["updated_at", "2023-08-03 17:09:08.857282"]]
INSERT INTO "messages" ("content", "user_type", "chat_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def receive(data)
    message_content = data['message']
    chat_id = data['chat_id']
    user_id = current_user.id
    @message = Message.create(content: message_content, user_id: user_id, chat_id: chat_id, user_type: "User")
    generated_response = TextGenerationService.generate_text(message_content)
    @response = ActionCable.server.broadcast(
        "chat_channel_#{user_id}",
        {
            message: message_content,
            response: generated_response,
            chat_id: chat_id
        }
    )
    @message = Message.create(content: generated_response, user_id: user_id, chat_id: chat_id, user_type: "Bot")