app/controllers/chats_controller.rb

  def index
    @current_user = current_user
    @chats = @current_user.chats.all.includes(:messages).sort_by { |chat| chat.messages.last&.created_at || Time.new(0) }.reverse
    @users = User.all
---
SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ?  [["user_id", 2]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" IN (?, ?, ?)  [["chat_id", 1], ["chat_id", 3], ["chat_id", 4]]
SELECT "users".* FROM "users"

  def create
    @chat = current_user.chats.create(chat_params)
---
INSERT INTO "chats" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Tooba"], ["user_id", 1], ["created_at", "2023-08-03 17:08:57.810725"], ["updated_at", "2023-08-03 17:08:57.810725"]]