app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "chat_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hellooo"], ["chat_id", 5], ["user_id", 1], ["created_at", "2023-08-03 09:42:34.898785"], ["updated_at", "2023-08-03 09:42:34.898785"]]
---
  def create
    @message = current_user.messages.create(content: message_params[:content], chat_id: params[:chat_id])

SELECT "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_chat
    @chat = Chat.find(params[:chat_id])